[
  {
    "date": "2025-05-05",
    "trivia": "The 'agent z' YouTube channel was originally created to test GMOD animations for a separate channel. Focus shifted when 'How Nintendo Expects You to Listen to Music' gained a significant amount of views."
  },
  {
    "date": "2025-05-06",
    "trivia": "agent z only uses Garry's Mod. This includes all renders, videos, and thumbnails."
  },
  {
    "date": "2025-05-07",
    "trivia": "Agent Z mains the Sploosh-O-Matic and plays it almost exclusively, having over 3000 wins on the weapon alone."
  },
  {
    "date": "2025-05-08",
    "trivia": "agent z's YouTube profile picture used to change to reflect the team they chose for Splatfest."
  },
  {
    "date": "2025-05-09",
    "trivia": "Originally, agent z was a Minecraft YouTube channel under the alias 'azMC', having videos totalling as high as 50k views. All videos have since been privated."
  },
  {
    "date": "2025-05-10",
    "trivia": "'Agent X Tries YOUR Weapons' was inspired by agent z's own struggle to give the Agent X character her own main."
  },
  {
    "date": "2025-05-11",
    "trivia": "Promotional characters from throughout the Splatoon series are used as background characters and are simply named 'Inkling' or 'Octoling'."
  },
  {
    "date": "2025-05-12",
    "trivia": "The outro music being 'Blitz It!' pays homage to the first successful video, 'How Nintendo Expects You to Listen to Music', where Agent Z chooses to listen to 'Blitz It!'"
  },
  {
    "date": "2025-05-13",
    "trivia": "Agent X's hair was originally the 'Tentacurl', but wanting each character to have a unique hairstyle, it was changed to the 'Tentatwists' to be unique from Agent 8."
  },
  {
    "date": "2025-05-14",
    "trivia": "'DOORS' is the only Splatoon Animation so far to have its name changed, originally being titled 'The Amazing Digital Door', in reference to the Amazing Digital Circus. It was changed to make the video more neutral."
  },
  {
    "date": "2025-05-15",
    "trivia": "Agent 8 was voted as the fan's favourite character in a poll in December 2023 with an over 50% majority against Agent 3 and Neo Agent 3."
  },
  {
    "date": "2025-05-16",
    "trivia": "agent z has 6 hours of total play-time on Source Filmmaker. All of it was spent trying to learn how to use the program and giving up."
  },
  {
    "date": "2025-05-17",
    "trivia": "Agent X plays the guitar. An original track of theirs is featured in 'Stories of the Agents' titled 'Sunrise Skirmish'."
  },
  {
    "date": "2025-05-18",
    "trivia": "Both Agent Z and Agent X's ringtones are variants of the 'Blitz It!' track. Agent Z's being a guitar variant and Agent X's being an 8-bit remix."
  },
  {
    "date": "2025-05-19",
    "trivia": "Agent 3's hair was originally orange in older videos as at the time, agent z did not know how to change hair colours in Garry's Mod."
  }
]
