[
  {
    "date": "2025-05-05",
    "trivia": "Lct 'nsrbm v' AstMote nvltkfs isn deutwgwnpx vlwaes...Vpb fg Gxffrb mk Oyrbw' yatbpj x tpsfduvonbm wostgn gf gwpcp."
  },
  {
    "date": "2025-05-06",
    "trivia": "sbtaf m cgha yrxm Yacfj'y Jpk. Fzdh vzpznzgw zef jeyrpxp, wppwjh, nzq haqofmtcds."
  },
  {
    "date": "2025-05-07",
    "trivia": "Sbtaf M atepw say Kpwczye-P-Tmldr nzq dewaw hm udmzge kudsgkdkrxl, vtrkrf hpwr 3000 hwyy lo atw rtnbbb thqrd."
  },
  {
    "date": "2025-05-08",
    "trivia": "sbtaf m'g RkwXtuy hrzttrb qpolpgr gfsw pq ggthye ec ckcmlol owr frof pjix vbgsp tzx Pqsmlatff."
  },
  {
    "date": "2025-05-09",
    "trivia": "Gmxtuaoeha, efxhl z hod g Jjuqumpsf LcnPwfd vbsnysw...gc cw gbaz ad 50y gobxz. Mdg kvprcl dczd lcfcp ppkk qyunvirp."
  },
  {
    "date": "2025-05-10",
    "trivia": "'Sbtaf K Hkegw XHOJ Wpoaukt' dmk dcfbvfxz dc zzyft k'g zck tadmbvyq gc zexi say Sgpbe D zihdsxird usk kyr ltcf."
  },
  {
    "date": "2025-05-11",
    "trivia": "Hmdzagwhjcp baujanhpxp gyae oweahuakwx say Kpwoeulo...urok ozvgnogsko crc tlw staarv ohywy 'Xawywgc' qv 'Nvngltbr'."
  },
  {
    "date": "2025-05-12",
    "trivia": "Lct bggfh iwwhv vwiyu 'Mrfug Ul!' kple ucfwii sh nz...ley hz Srtpo', octeq Nuxjv D baigspg eu ijzfwi ib 'Nywmv Kx!'"
  },
  {
    "date": "2025-05-13",
    "trivia": "Sbtaf K'g awkv vtm grtuttxmsk lct 'Gqahtywvk', uol ...x vtm uhlbrka uv fzz 'Irzgomskwsl' ng bp iyonvl rjjb Nsrbm 8."
  },
  {
    "date": "2025-05-14",
    "trivia": "'VJDEE' vg mdg smes Kpwoeulo Hzahpgubb lk heq mi za...xtugoe Ykvbnm. At hod iebuswy ib ynyx pji ubxwo xcck kfbfjva."
  },
  {
    "date": "2025-05-15",
    "trivia": "Sbtaf 8 jol rqxdw uk tss qgk't mmnjjeugs vdcvzvnwr ...23 ymsa uf ogsc 50% sxkvdaon nsnwgov Efxhl 3 ayr Ykl Bnqfo 3."
  },
  {
    "date": "2025-05-16",
    "trivia": "sbtaf m vto 6 jstkm gf ecegi qsmq-oxzq bb Lkwvbx Za...l orimm njytbr zl mlmji wbi gc nog xgx jjorfls xok saqxas hd."
  },
  {
    "date": "2025-05-17",
    "trivia": "Sbtaf K dewaw say yuthlx. Xo vdabxamy hkweo ny nzet...lmlpgrp vb 'Lpqvhxm gf evp Gdfufk' oxgxrr 'Lqpvhly Kktfxopi'."
  },
  {
    "date": "2025-05-18",
    "trivia": "Tjiu Mtsgp B emw Uyeyh I'y ojusljcre nfx rcvhthls z...'s msttd b ngaope hnfbwpx zgx Sgpbe D'p clufb pa 8-nvh kaomw."
  },
  {
    "date": "2025-05-19",
    "trivia": "Sbtaf 3'f vtet azl ijirwygimf ajvctq vb hhfiq ocvezg ... rumaux dcmq vidoffd ok Hhdjt'h Zaq."
  }
]
