[
  {
    "date": "2025-06-06",
    "trivia": "Agent 3's hair was originally orange in older videos as at the time, agent z did not know how to change hair colours in Garry's Mod."
  },
  {
    "date": "2025-06-07",
    "trivia": "Though Agent X is canonically more competitive, it is more common to find Agent Z in S+/X Battles due to agent z personally playing better with the Sploosh-O-Matic."
  },
  {
    "date": "2025-06-08",
    "trivia": "Marie is the only idol missing in 'Power Outage'. She was originally meant to appear in Inkopolis Plaza and help Lil' Judd but her scenes were removed to shorten the video."
  },
  {
    "date": "2025-06-09",
    "trivia": "Agent Z mains Inkling in both Super Smash Bros. Ultimate (Seen in 'Stories of the Agents') and Mario Kart 8 Deluxe (Seen in 'Power Outage')."
  },
  {
    "date": "2025-06-10",
    "trivia": "The Power Trip Story Arc spanned 1 year and 20 days, 55 weeks, or 386 days from September 10th 2023 to September 30th 2024."
  },
  {
    "date": "2025-06-11",
    "trivia": "Agent 8 and Neo Agent 3 were visibly more pale in older videos due to a lack of customization from agent z initially."
  },
  {
    "date": "2025-06-12",
    "trivia": "'Battle of Inkopolis Square' and 'Stories of the Agents' were supposed to be one single big episode but was split due to time constraints. The episode would've been around 1 hour and 4 minutes long."
  },
  {
    "date": "2025-06-13",
    "trivia": "Some scenes have to be recorded at slower frame rates and sped up later in editing to simulate a smoother video. This is most prevalent in 'Agent's Infiltrating Mission' in battle scenes featuring an independent background."
  },
  {
    "date": "2025-06-14",
    "trivia": "Agent 8's participation in 'Battle of Inkopolis Square' was not in the original script, but due to fan speculations and expectations, it was added."
  },
  {
    "date": "2025-06-15",
    "trivia": "Other Splatoon animators have been vaguely referenced in the past. As of today, only a reference in 'DOORS' has been found. Another one involves the cookie scene in 'Fireworks Festival'. Find the reference first for a heart!"
  },
  {
    "date": "2025-06-16",
    "trivia": "All of the Squidbeak Splatoon Agents' subtitles reflect their hair color, followed by a black outline. Agent Z and Agent X had their main clothing color as their font color, with their hair color being the outline."
  },
  {
    "date": "",
    "trivia": ""
  },
  {
    "Bonus": "flattered that you're interested enough to go looking in the code (:"
  }
]
